In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('SalaryGender.csv')

In [3]:
df.head()

   Salary  Gender  Age  PhD
0   140.0       1   47    1
1    30.0       0   65    1
2    35.1       0   56    0
3    30.0       1   23    0
4    80.0       0   53    1

In [4]:
sal_arr = np.array(df['Salary'])
gen_arr = np.array(df['Gender'])
age_arr = np.array(df['Age'])
phd_arr = np.array(df['PhD'])

In [5]:
# saving array in local directory

np.save('sal_arr', sal_arr)
np.save('gen_arr', gen_arr)
np.save('age_arr', age_arr)
np.save('phd_arr', phd_arr)